[
  {
    "file": "experiments/WFranke.js",
    "name": "Interpretation - Oszillogramme",
    "description": "Recreation/Interpretation of Herbert W. Franke's Artwork 'Oszillogramme'."
  },

  {
    "file": "experiments/WFrankeAnimated.js",
    "name": "Oszillogramme - Version 2: Colorful Oszillogramme",
    "description": "Made it animated and colorful."
  },

  {
    "file": "experiments/WFrankeUpdated.js",
    "name": "Oszillogramme - Version 3: Colorful Squares",
    "description": "I wanted to create something that looked like an old Windows screensaver, and I played around with the code for the previous artowork and this is the result."
  },

  {
    "file": "experiments/Schotter.js",
    "name": "Interpretation - Schotter",
    "description": "Recreation/Interpretation of Georg Ness Artwork 'Schotter'."
  },

  {
    "file": "experiments/SchotterAnimated.js",
    "name": "Schotter - Version 2: Waterfall 'Schotter'",
    "description": "It is a 'square waterfall', because I wanted to make it animated, and this way I thought was the best looking way while still keeping the multiple squares, and their rotation. At first I managed to create something that was similar to the first version (which looks the most like Schotter, but that also came with an annoying feature (sorta glitching). So I went for this look instead."
  },

  {
    "file": "experiments/Square.js",
    "name": "Schotter - Version 3: I'm Just A Square",
    "description": "A very random version of Schotter. The square changes color when hitting the border of the canvas."
  },
  {
    "file": "experiments/BlueLiteral.js",
    "name": "Interpretation: Blue Literal - Flow field version",
    "description": "This is an effort to recreate Blue Literal by Tyler Hobbs, but in flow field style."
  },

  {
    "file": "experiments/BlueLiteralClick.js",
    "name": "Blue Literal - Version 2: 'Click to Flow'",
    "description": "Click the screen to change the flow of the field."
  },

  {
    "file": "experiments/BlueLiteralAnotherOne.js",
    "name": "Blue Literal - Version 3: 'Click to Color'",
    "description": "A version of Blue Literal where you click the artwork to experience different colors of it."
  },
  {
    "file": "experiments/iceSwirls.js",
    "name": "Additional Artwork: 'Ice Swirls'",
    "description": "An additional artwork, where the idea is to mimic ice swirls. Using lerpColors I was able to create the 'gradient' effect. This artwork is not inspired by any artist's previous work, it is straight from my own brain."
  },
  {
    "file": "experiments/iceSwirlsPixieDust.js",
    "name": "Additional Artwork: 'Ice Swirls - Version 2: Pixie Dust'",
    "description": "A version of 'Ice Swirls', where I basically just played around with the different values of the code and accidently ended up here. I like the small ellipses that make it look more 'magical' and mimics pixie dust. Was a huge fan of Tinkerbell when I was a kid, and this artwork kind of reminds me of Tinkerbell Secret of the Wings, for some context to the name."
  },
  {
    "file": "experiments/iceSwirlsColor.js",
    "name": "Additional Artwork: 'Ice Swirls - Version 3: Cool colors'",
    "description": "A version of 'Ice Swirls' where it is no longer ice swirls at all. Played around with lerpColors and with these changes it was made best with a black background."
  },

  {
    "file": "experiments/tone.js",
    "name": "'I'm just A Square' with Sound",
    "description": "This is pretty much the same code as 'I'm Just A Square' except the speed has been ramped up to play the song faster. Each time the square hits the border of the canvas it plays the next note in the song. And when the song is over (aka all notes have been played in the array) it starts from the very first note again."
  }
]
