[
  {
    "file": "experiments/WFranke.js",
    "name": "Interpretation - Oszillogramme",
    "description": "Recreation/Interpretation of Herbert W. Franke's Artwork 'Oszillogramme'. -- Explains the what and the why. What is the main idea? What is the purpose? Describes the coding process and implementation choices and gives a high level system overview."
  },

  {
    "file": "experiments/WFrankeAnimated.js",
    "name": "Version 2: Colorful Oszillogramme",
    "description": "Explains the what and the why. What is the main idea? What is the purpose? Describes the coding process and implementation choices and gives a high level system overview."
  },

  {
    "file": "experiments/WFrankeUpdated.js",
    "name": "Version 3: Colorful Squares",
    "description": "I wanted to create something that looked like an old Windows screensaver, and I played around with the code for the previous artowork and this is the result.-- Describes the coding process and implementation choices and gives a high level system overview."
  },

  {
    "file": "experiments/Schotter.js",
    "name": "Interpretation - Schotter",
    "description": "Recreation/Interpretation of Georg Ness Artwork 'Schotter' -- Explains the what and the why. What is the main idea? What is the purpose? Describes the coding process and implementation choices and gives a high level system overview."
  },

  {
    "file": "experiments/SchotterAnimated.js",
    "name": "Version 2: Waterfall 'Schotter'",
    "description": "It is a 'square waterfall', because I wanted to make it animated, and this way I thought was the best looking way while still keeping the multiple squares, and their rotation. At first I managed to create something that was similar to the first version (which looks the most like Schotter, but that also came with an annoying feature. So I went for this look instead."
  },

  {
    "file": "experiments/Square.js",
    "name": "Version 3: I'm Just A Square",
    "description": "Again I was inspired by old windows screensavers. At first I wanted it to be the entire original Schotter artwork that would be flying around, but with each frame the squares are updated and changing position, which made it look glitchy, and not a look I was going for so I decided to do a simple square. Still keeping pretty much the same code as OG Schotter, but without the randomization, and jitter, etc. And this is where we ended up."
  },
  {
    "file": "experiments/BlueLiteral.js",
    "name": "Interpretation: 'Blue Literal - Flow field version'",
    "description": "Explains the what and the why. What is the main idea? What is the purpose? Describes the coding process and implementation choices and gives a high level system overview."
  },

  {
    "file": "experiments/BlueLiteralClick.js",
    "name": "Blue Literal - Version 2: 'Click to Flow'",
    "description": "Explains the what and the why. What is the main idea? What is the purpose? Describes the coding process and implementation choices and gives a high level system overview."
  },

  {
    "file": "experiments/BlueLiteralAnotherOne.js",
    "name": "Blue Literal - Version 3: 'Click to Color'",
    "description": "A version of Blue Literal where you click the artwork to experience different colors of it... What is the main idea? What is the purpose? Describes the coding process and implementation choices and gives a high level system overview."
  },
  {
    "file": "experiments/iceSwirls.js",
    "name": "Additional Artwork: 'Ice Swirls'",
    "description": "An additional artwork, where the idea is to mimic ice swirls. Using lerpColors I was able to create the 'gradient' effect. This artwork is not inspired by any artist's previous work, it is straight from my own brain."
  },
  {
    "file": "experiments/iceSwirlsPixieDust.js",
    "name": "Additional Artwork: 'Ice Swirls - Version 2: Pixie Dust'",
    "description": "A version of 'Ice Swirls', where I basically just played around with the different values of the code and accidently ended up here. I like the small ellipses that make it look more 'magical' and mimics pixie dust. Was a huge fan of Tinkerbell when I was a kid, and this artwork kind of reminds me of Tinkerbell Secret of the Wings, for some context to the name."
  },
  {
    "file": "experiments/iceSwirlsColor.js",
    "name": "Additional Artwork: 'Ice Swirls - Version 3: Cool colors'",
    "description": "A version of 'Ice Swirls' where it is no longer ice swirls at all. Played around with lerpColors and with these changes it was made best with a black background. The colors randomly change when page is refreshed."
  }
]
